## 🏗️ Terraform Plan Preview

## 📋 Terraform Plan Summary

### Resource Changes

- ✅ **Resources to Add:** 6
- 🔄 **Resources to Change:** 2
- ❌ **Resources to Destroy:** 0
0

<details>
<summary>📄 Full Plan Output (click to expand)</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lb.main has changed
  ~ resource "aws_lb" "main" {
      + arn                                         = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/6851c05c79c0dc99"
      + dns_name                                    = "protein-classifier-alb-1040581991.us-west-2.elb.amazonaws.com"
        id                                          = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/6851c05c79c0dc99"
        name                                        = "protein-classifier-alb"
        tags                                        = {
            "Description" = "Application Load Balancer for protein classifier API"
            "Name"        = "protein-classifier-alb"
        }
      + zone_id                                     = "Z1H1FL5HABSF5"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.vpc_flow_logs will be updated in-place
  # (imported from "/aws/vpc/protein-classifier-flow-logs")
  ~ resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
        arn               = "arn:aws:logs:us-west-2:462498369025:log-group:/aws/vpc/protein-classifier-flow-logs"
        id                = "/aws/vpc/protein-classifier-flow-logs"
      + kms_key_id        = "arn:aws:kms:us-west-2:462498369025:key/10f4c063-fe36-457f-a1f8-d7fe90d29bdc"
        log_group_class   = "STANDARD"
        name              = "/aws/vpc/protein-classifier-flow-logs"
      ~ retention_in_days = 0 -> 7
        skip_destroy      = false
      ~ tags              = {
          + "Description" = "CloudWatch log group for VPC flow logs"
          + "Name"        = "protein-classifier-vpc-flow-logs"
        }
      ~ tags_all          = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "CloudWatch log group for VPC flow logs"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-vpc-flow-logs"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
    }

  # aws_dynamodb_table.terraform_locks will be updated in-place
  # (imported from "protein-classifier-terraform-locks")
  ~ resource "aws_dynamodb_table" "terraform_locks" {
        arn                         = "arn:aws:dynamodb:us-west-2:462498369025:table/protein-classifier-terraform-locks"
        billing_mode                = "PAY_PER_REQUEST"
        deletion_protection_enabled = false
        hash_key                    = "LockID"
        id                          = "protein-classifier-terraform-locks"
        name                        = "protein-classifier-terraform-locks"
        read_capacity               = 0
        stream_enabled              = false
        table_class                 = "STANDARD"
      ~ tags                        = {
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Name"        = "protein-classifier-terraform-locks"
        }
      ~ tags_all                    = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "DynamoDB table for Terraform state locking"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-terraform-locks"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
        write_capacity              = 0

        attribute {
            name = "LockID"
            type = "S"
        }

      ~ point_in_time_recovery {
          ~ enabled                 = false -> true
            recovery_period_in_days = 0
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:us-west-2:462498369025:key/303b4c09-95cb-4768-ad8a-71580b460798"
        }

        ttl {
            enabled = false
        }
    }

  # aws_ecs_service.api will be created
  + resource "aws_ecs_service" "api" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:us-west-2:462498369025:cluster/protein-classifier-api-1-0-0-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "protein-classifier-api-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Description" = "ECS Fargate service running protein classifier API"
          + "Name"        = "protein-classifier-api-service"
        }
      + tags_all                           = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "ECS Fargate service running protein classifier API"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-api-service"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + task_definition                    = "arn:aws:ecs:us-west-2:462498369025:task-definition/protein-classifier-api:4"
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "protein-classifier-api"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/9fa69655ab37259f"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-058215edd5204ee11",
            ]
          + subnets          = [
              + "subnet-0a139088551e0b632",
              + "subnet-0f46335560d77cd0f",
            ]
        }
    }

  # aws_flow_log.main will be created
  + resource "aws_flow_log" "main" {
      + arn                      = (known after apply)
      + iam_role_arn             = "arn:aws:iam::462498369025:role/protein-classifier-vpc-flow-logs-role"
      + id                       = (known after apply)
      + log_destination          = "arn:aws:logs:us-west-2:462498369025:log-group:/aws/vpc/protein-classifier-flow-logs"
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Description" = "VPC flow log for network traffic monitoring"
          + "Name"        = "protein-classifier-vpc-flow-log"
        }
      + tags_all                 = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Description" = "VPC flow log for network traffic monitoring"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "protein-classifier-vpc-flow-log"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0c496efac807d4d86"
    }

  # aws_iam_role_policy.vpc_flow_logs will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id          = (known after apply)
      + name        = "protein-classifier-vpc-flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-west-2:462498369025:log-group:/aws/vpc/protein-classifier-flow-logs:*"
                      + Sid      = "CloudWatchLogPermissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "protein-classifier-vpc-flow-logs-role"
    }

  # aws_lb.main is tainted, so must be replaced
-/+ resource "aws_lb" "main" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/6851c05c79c0dc99" -> (known after apply)
      ~ arn_suffix                                                   = "app/protein-classifier-alb/6851c05c79c0dc99" -> (known after apply)
      ~ dns_name                                                     = "protein-classifier-alb-1040581991.us-west-2.elb.amazonaws.com" -> (known after apply)
      ~ drop_invalid_header_fields                                   = false -> true
      - enable_cross_zone_load_balancing                             = true -> null
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-west-2:462498369025:loadbalancer/app/protein-classifier-alb/6851c05c79c0dc99" -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
        name                                                         = "protein-classifier-alb"
      + name_prefix                                                  = (known after apply)
        tags                                                         = {
            "Description" = "Application Load Balancer for protein classifier API"
            "Name"        = "protein-classifier-alb"
        }
      ~ vpc_id                                                       = "vpc-0c496efac807d4d86" -> (known after apply)
      ~ zone_id                                                      = "Z1H1FL5HABSF5" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = "protein-classifier-alb-logs-462498369025"
          ~ enabled = false -> true
          + prefix  = "alb-logs"
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0e67523b84c5a47d5" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0ecde20f7a1196802" -> null
        }
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-west-2:462498369025:certificate/fb6e4304-ece7-4ad7-87dd-14524aa5eef6"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-Ext1-2021-06"
      + tags_all                                                              = {
          + "Application" = "protein-classifier-api"
          + "CostCenter"  = "protein-classifier"
          + "Environment" = "Prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "protein-classifier"
          + "Repository"  = "kmesiab/concept-model-protein-classifier"
          + "Service"     = "protein-classifier"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:462498369025:targetgroup/protein-classifier-ecs-tg/9fa69655ab37259f"
          + type             = "forward"
        }
    }

  # aws_route53_record.api will be created
  + resource "aws_route53_record" "api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.proteinclassifier.com"
      + type            = "A"
      + zone_id         = "Z0960642JHAEZB1G2JKV"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

Plan: 2 to import, 7 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + alb_dns_name            = (known after apply)
```
</details>

### 🔍 Key Changes Detected

- 🐳 **ECS Service** changes detected
- ⚖️ **Load Balancer** changes detected
- 🔑 **IAM** changes detected

### ✅ Validation Status

- **Format Check:** ✅ Pass
- **Init:** ✅ Pass
- **Validate:** ✅ Pass
- **Plan:** ✅ Pass


---
<sub>💡 This plan preview helps you review infrastructure changes before applying them.</sub>
